service/app/controllers/links_controller.rb

  def index
    @links = Link.all
---
SELECT * FROM "links"

  def show
    @link = Link.find(params[:id])
---
SELECT * FROM "links" WHERE ("links"."id" = 1)

  def create
    @link = Link.new params[:link]
    if @link.save
---
INSERT INTO "links" ("updated_at", "title", "url", "notes", "created_at") VALUES('2010-04-22 20:56:20', NULL, 'bla', NULL, '2010-04-22 20:56:20')

  def update
    if @link.update_attributes params[:link]
---
UPDATE "links" SET "notes" = 'test', "updated_at" = '2010-04-22 20:57:35' WHERE "id" = 2

  def destroy
    @link.destroy
---
DELETE FROM "links" WHERE "id" = 1

  def load_link
    @link = Link.find(params[:id])
---
SELECT * FROM "links" WHERE ("links"."id" = 1)