service/app/controllers/tags_controller.rb

  def index
    @tags = Tag.all
---
SELECT * FROM "tags"

  def load_tag
    @tag = Tag.find(params[:id])
---
SELECT * FROM "tags" WHERE ("tags"."id" = 1)